# GetEnumerator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FluidType..::..GetEnumerator Method
FluidType Class See Also
---
Returns an enumerator that iterates through a collection.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual IEnumerator<FluidTemperature> GetEnumerator()
```

Visual Basic
---
```text
Public Overridable Function GetEnumerator As IEnumerator(Of FluidTemperature)
```

Visual C++
---
```text
public:
virtual IEnumerator<FluidTemperature^>^ GetEnumerator()
```

# ### Return Value
An IEnumerator object that can be used to iterate through the collection.
# ### Implements
IEnumerable<(Of <(<'T>)>)>..::..GetEnumerator()()()()
# See Also
FluidType Class
Autodesk.Revit.DB.Plumbing Namespace